app/Controllers/Clientes.php

    public function index()
    {
        $clientes = $this->cliente_model
                                    ->findAll();
---
SELECT *
FROM `clientes`

    public function store()
    {
        $dados = $this->request->getVar();

        if(isset($dados['id_cliente'])):

            $this->cliente_model
                ->where('id_cliente', $dados['id_cliente'])
                ->set($dados)
                ->update();

            $session = session();
            $session->setFlashdata('alert', 'success_update');

            return redirect()->to("/clientes/editar/{$dados['id_cliente']}");

        endif;

        $this->cliente_model->insert($dados);
---
INSERT INTO `clientes` (`nome`, `data_de_nascimento`, `telefone`, `endereco`, `limite_de_credito`, `created_at`, `updated_at`) VALUES ('Ronaldo', '1990-12-15', '31992374646', 'Rua Paraná, 80', '4000', '2023-05-05 16:40:58', '2023-05-05 16:40:58')

    public function excluir()
    {
        $id_cliente = $this->request->getVar('id_cliente');

        $this->cliente_model
            ->where('id_cliente', $id_cliente)
            ->delete();
---
DELETE FROM `clientes`
WHERE `id_cliente` = '1'