app/Controllers/Funcionarios.php

    public function index()
    {
        $data['funcionarios'] = $this->funcionario_model
                                                    ->findAll();
---
SELECT *
FROM `funcionarios`

    public function ver($id_funcionario)
    {
        $data['funcionario'] = $this->funcionario_model
                                            ->where('id_funcionario', $id_funcionario)
                                            ->first();
---
SELECT *
FROM `funcionarios`
WHERE `id_funcionario` = '4'
 LIMIT 1

    public function editar($id_funcionario)
    {
        $data['funcionario'] = $this->funcionario_model
                                                ->where('id_funcionario', $id_funcionario)
                                                ->first();
---
SELECT *
FROM `funcionarios`
WHERE `id_funcionario` = '1'
 LIMIT 1

    public function store()
    {
        $dados = $this->request->getVar();

        $session = session();

        if (isset($dados['id_funcionario'])) :
            $this->funcionario_model
                ->where('id_funcionario', $dados['id_funcionario'])
                ->set($dados)
                ->update();

            $session->setFlashdata('alert', 'success_update');

            return redirect()->to("/funcionarios/editar/{$dados['id_funcionario']}");

        endif;
        $this->funcionario_model
            ->insert($dados);
---
INSERT INTO `funcionarios` (`nome`, `data_de_nascimento`, `rg`, `cpf`, `telefone`, `endereco`, `data_de_contratacao`, `cargo`, `salario`, `dia_de_pagamento`, `created_at`, `updated_at`) VALUES ('Diogo', '1991-03-03', '20193777', '705.487.99944', '31992374646', 'Rua Florenza, 145', '2023-02-08', 'Motorista', '2000', '5', '2023-05-05 12:00:16', '2023-05-05 12:00:16')

    public function delete()
    {
        $id_funcionario = $this->request->getVar('id_funcionario');

        $this->funcionario_model
            ->where('id_funcionario', $id_funcionario)
            ->delete();
---
DELETE FROM `funcionarios`
WHERE `id_funcionario` = '11'