app/Controllers/Login.php

    public function autenticar()
    {
        $dados = $this->request->getVar();

        $usuario = $this->login_model
                        ->where('usuario', $dados['usuario'])
                        ->where('senha', md5($dados['senha']))
                        ->first();
---
SELECT *
FROM `logins`
WHERE `usuario` = 'admin'
AND `senha` = '123'
 LIMIT 1

    public function store()
    {
        $dados = $this->request->getVar();

        $usuario = $this->login_model
                        ->where('id_login', 1)
                        ->first();

        $session = session();

        if(md5($dados['senha_atual']) == $usuario['senha']):

            if($dados['nova_senha'] = $dados['confirmar_nova_senha']):

                $this->login_model
                    ->where('id_login', 1)
                    ->set('senha', md5($dados['nova_senha']))
                    ->update();
---
SELECT *
FROM `logins`
WHERE `id_login` = 1
 LIMIT 1
UPDATE `logins` SET `senha` = '202cb962ac59075b964b07152d234b70', `updated_at` = '2023-05-04 18:20:41'
WHERE `id_login` = 1