app/Controllers/Produtos.php

SELECT *
FROM `produtos`
---
    public function index()
    {
        $data['produtos'] = $this->produto_model
                                            ->findAll();